<script setup>
import { reactive } from 'vue';
const postList = reactive([
  {
    id: '01',
    name: 'user-1',
    title: '台北第一高峰@七星山👍還是半天的輕旅行最可愛',
    content: '天氣很可以的早上👌滿滿的芬多精，吸好吸滿😄好山友👌旅伴🏔攝影咖📷美食獵人🥗人生好隊友在哪呢？😆完美360度的完美展望👍看山望海）',
    time: '2024-11-18 10:00',
    img: 'https://i0.wp.com/www.tripresso.com/blog/wp-content/uploads/2021/02/7.jpeg?resize=616%2C347'
  },
  {
  id: '02',
  name: 'user-2',
  title: '2024/11/16-17秘境泡湯',
  content: '快半年前就安排好的泰崗溫泉，討厭的颱風又害我不能去😭為了不讓大家失望，這星期腦細胞不知道死了多少😮‍💨最後決定倒團後又敗部復活往北部走，意外的吃了兩頓大餐🤭又泡了期待超級久的溫泉🥰🤭每當天氣預報不好，出團於否的每一個小細節都必須更嚴謹思考幸好還是出遊了🥰雖然天氣因素無法很完美，在我心裡最美的不是風景，而是每一次的相',
  time: '2024-11-11 10:00',
  img: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT11qEDxU4X_MVKYQVU5qiAVFidA58f8GG0bQ&s'
  }
])
postList.sort((a, b) => new Date(b.time) - new Date(a.time));
</script>
